USE EVENTFRAME;
GO

-- Создание Партии 
DECLARE @batchId NVARCHAR(50);
EXECUTE AddEventFrame 'Партия 54321-10', 'Партия', @batchId OUTPUT;

-- Создание значений для партии
DECLARE @BatchParams AS ParametersTableType;
INSERT INTO @BatchParams (Name, Value) VALUES
	('Номер партии', '54321-10'),
	('Смена (послед. изм.)', 'В'),
	('ФИО раздельщика', 'Курочкин А. П.'),
	('Контракт', 'А708-256'),
	('ФИО (поток мелкий)', 'Арызбаев У.Я.'),
	('Тип контрагента', 'Внутренний'),
	('Тип тары', 'Бочка'),
	('Дата изготовления', '02.03.2023'),
	('ФИО раздельщика', 'Исаев А. Н.'),
	('ФИО УУ', 'Смехов А.П.'),
	('Согласование', 'Подтвержден'),
	('ФИО раздельщика 1', 'Сидоренко С. Я.'),
	('Масса (брутто), кг', '4513.2'),
	('Состояние', 'Готов к перетариванию'),
	('Кол-во тарных мест, шт', '1'),
	('Место хранения', 'Уч. взвешивания'),
	('Дата (послед. изм.)', '04.03.2023'),
	('Состав', 'Да'),
	('ФИО контр. ОТК, принявшего партию', 'Кречун Е. М.'),
	('Пользователь (послед. изм.)', 'Регидронов Р. А.'),
	('Масса (нетто), кг', '4120.0'),
	('Спецификация', 'ГОСТ 519'),
	('Тип ТГ', 'Сортная'),
	('Контрагент', 'ATI'),
	('Марка', 'ТГ-90'),
	('Срок годности', '02.09.2023'),
	('ФИО сортировщика, сдавшего партию', 'Али А. Ю. Ж.'),
	('ФИО раздельщика 2', 'Кучеров Е. М.'),
	('Фракция (LIMS)', '12+80')

EXEC AddEventFrameValues @batchId, @BatchParams;

-- Обновление одного из значений партии
DECLARE @batchNumber NVARCHAR(50) = '54321-10';
DECLARE @parameterName NVARCHAR(50) = 'Фракция (LIMS)';
DECLARE @newParameterValue NVARCHAR(100) = 'Работает!'

EXEC UpdateBatchParameter @batchNumber, @parameterName, @newParameterValue

-- Вывод измененной партии
EXEC SelectEventsWithValuesById @batchId

-- Удаление демонстративной партии
DELETE FROM EventFrames WHERE Id=@batchId;
